Repository: Vaseemes/VaRtranslators
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: cs_cz

source: - Blood Suger Control -
cs_cz: - Regulace hladiny cukru v krvi -

source: 1) One package is usually enough for a treatment course.
cs_cz: 1) Jedno balení zpravidla vystačí na celý průběh léčby.

source: 2) Patients interrupted the treatment course before they managed to notice results.
cs_cz: 2) Pacienti přerušili léčbu ještě před začátkem účinku.

source: 2) Prepare the skin for cream use.
cs_cz: 2) Kůži před aplikací krému správně ošetřete.

source: #healthylife #diabetes #bloodsugar
cs_cz: #zdravyzivot #cukrovka #cukrvkrvi

source: The product can be safely combined with other drugs used to treat prediabetes and diabetes.
cs_cz: Produkt lze bezpečně kombinovat s jinými léky, užívanými pro léčbu prediabetu a cukrovky.

source: The product is helpful in:
cs_cz: Produkt podporuje:

source: Never exceed the dosage.
cs_cz: Nikdy nepřekračujte doporučené dávkování.

source: User reviews and experience, doctor recommendation, how to apply, effects, where to buy in pharmacies, price
cs_cz: Uživatelské recenze a zkušenosti s produkte, doporučení lékařů, jak se produkt používá, účinky krému, místa prodeje, cena

source: Do not cease your insulin intake, if prescribed by your doctor.
cs_cz: Nikdy nepřerušujte dávkování inzulínu předepsané vaším lékařem.

source: User reviews, doctor advice, first-hand experience, how to take, effects, where to buy in pharmacies, price
cs_cz: Recenze uživatelů, rady doktorů, zkušenosti uživatelů, jak se kapsle užívají, efekty, v jakých lékárnách výrobek prodávají, cena

source: A fake product was purchased instead of the original.
cs_cz: Místo originálního krému byl zakoupen padělek.

source: A few years ago, I started experiencing chronic and acute pain in my left knee and my lower back.
cs_cz: P5ed několika lety jsem začal trpět chronickou a akutní bolestí v levém koleni a v oblasti kříže.

source: A lot of my patients apply Hondrocream and report about sufficient improvement.
cs_cz: Mnoho mých pacientů používá Hondrocream a je u nich viditelné zlepšení.

source: A surprising fact is that some fakes can be purchased on Amazon or in pharmacies online.
cs_cz: Překvapující je fakt, že některé padělky lze koupit i na oficiálních sítích společnosti Amazon či e-shopech lékáren.

source: Active lifestyle and healthy living may protect from a lot of diseases except for joint and spine conditions.
cs_cz: Aktivní a zdravý životní styl váš může ochránit před mnoha nemocemi, kromě nemocí kloubů a páteře.

source: After I gained weight the situation aggravated.
cs_cz: Co jsem přibral, situace se ještě více zhoršila.

source: After a complete course of 30 days I take the stairs and enjoy hiking again – what can be better?
cs_cz: Po celkové léčbě, která trvala 30 dnů jsem už chodil po schodech a znovu si mohl užívat turistiku, co víc si přát?

source: All you need is to leave your contacts and discover top properties of the supplement before ordering it: action, manufacturer promises, components, contraindication, tips on how to take a lot of other valuable information.
cs_cz: Vše co je třeba udělat je poskytnout nám na vás kontakt a my vám před objednáním produktu poskytneme všechny důležité informace: účinky, záruku výrobce, složení, kontraindikaci, tipy pro získání dalších užitečných informací.

source: Also, they can supplement the diet and medications prescribed by your therapist.
cs_cz: Také mohou podpořit účinky léků a stravy, které vám předepsal lékař.

source: Although the disease cannot be completely cured, there are new ways to minimize its manifestations and live a full life.
cs_cz: I když je tato nemoc nevyléčitelná, existují jisté způsoby jak minimalizovat její projevy a žít plnohodnotný život.

source: Apply it and gently rub until the cream is partially absorbed.
cs_cz: Krém naneste na kůži a jemně jej vmasírujte, dokud není částečně absorbován.

source: Athletes, who must deal with consequences after old sports traumas.
cs_cz: Sportovcům, kteří se musí vypořádat s následky zranění.

source: Balancing metabolic processes;
cs_cz: Vyvážení metabolických procesů;

source: Be aware of scammers, who create fake pages for selling poor-quality replica of this cream.
cs_cz: Dávejte si pozor na podvodníky, kteří vytvářejí falešné stránky, kde prodávají nekvalitní repliky tohoto krému.

source: Be careful and order from the official website only.
cs_cz: Buďte opatrní a výrobky objednávejte pouze z oficiálních webových stránek.

source: Bean extract – fights with feelings of uncontrollable thirst and hunger.
cs_cz: Extrakt z fazolí - pomáhá utišit pocit nekontrolovatelné žízně a hladu.

source: Boosts natural collagen synthesis for self-restoration;
cs_cz: Zvyšuje přirozenou syntézu kolagenu..

source: Camphor – removes welling and soothes inflamed area due to its warming analgesic effect;
cs_cz: Kafr - díky jeho analgetickým účinkům odstraňuje otok a zklidňuje zanícenou oblast;

source: Causes no allergies or addiction to components.
cs_cz: Nezpůsobuje žádné alergie nebo závislost.

source: Cayenne pepper extract – helps other components penetrate deeper tissues, warms up the muscles and ligaments;
cs_cz: Extrakt kajenského pepře - pomáhá dalším přísadám proniknout hlouběji do tkáně, prohřívá svaly a vazy;

source: Clinical studies found no side effects except for very rare individual intolerance of capsule components.
cs_cz: Klinické studie nenalezly žádní vedlejší účinky kromě velmi vzácné individuální nesnášenlivosti ke složení kapslí.

source: Clinical tests all over the world engaged over 400 participants of various age.
cs_cz: Do klinických testů z celého světa se zapojilo přes 400 účastníků různých věkových skupin.

source: Complications of diabetes may include:
cs_cz: Komplikace způsobené cukrovkou zahrnují:

source: Contraindications to product use include young age (under 18), pregnancy and breastfeeding.
cs_cz: Produkt by neměly používat těhotné a kojící ženy a mladiství (do 18 let).

source: Cream contraindications include:
cs_cz: Kontraindikace zahrnují:

source: Customers say about a warming feeling about 30 minutes after application.
cs_cz: Někteří zákazníci při aplikaci ve svých hodnoceních popisují hřejivý pocit přibližně 30 minut po aplikaci krému.

source: Dandelion extract – intensifies blood circulation in tissues and helps to excrete excess fluid;
cs_cz: Extrakt z pampelišky - posiluje cirkulaci krve v tkáni a pomáhá s vylučováním přebytečných tekutin;

source: Detailed review about SugaNorm – supplement to help you control blood sugar and avoid diabetes.
cs_cz: Detailní recenze výrobku SugaNorm - doplněk stravy, který pomáhá regulovat hladinu cukru v krvi a předcházet cukrovce

source: Do not discontinue the intake earlier than in 30 days.
cs_cz: Nepřerušujte léčbu dříve než po 30 dnech.

source: Doctor reviews state that the product has several therapeutic results:
cs_cz: Recenze doktorů, kteří uvádí, že má tento produkt mnoho léčivých výsledků:

source: Dozens of positive customer comments, official doctor testimonials, and third-party reviews prove the efficacy of Hondrocream.
cs_cz: Desítky pozitivních komentářů od zákazníků, oficiální prohlášení doktorů a recenze třetích stran prokazují účinnost výrobku Hondrocream.

source: During multiple clinical studies, the combination of components is hypoallergenic and work well in precise dosages and combinations used by manufacturer.
cs_cz: Dle mnoha klinických studií je kombinace složení hypoalergenní. Díky správné kombinaci složek a dávkování výrobcem tyto kapsle fungují skvěle.

source: Elderflower seeds – have antibacterial properties and speed up self-healing processes;
cs_cz: Semínka černého bezu - mají antibakteriální účinek a urychlují proces hojení;

source: Elderly people with chronic aches of unknown nature;
cs_cz: Starším lidem s chronickou bolestí neznámé povahy;

source: Eliminates pain in spine, joints and ligaments;
cs_cz: Eliminuje bolest páteře, kloubů a vazů;

source: Enhances Healthy Weight Loss
cs_cz: Podporuje zdravé hubnutí

source: Erectile dysfunction and low libido;
cs_cz: Erektilní dysfunkci a nízké libido;

source: Eucalyptus oil – warms up, fights degeneration processes and pain;
cs_cz: Eukalyptový olej - pomáhá zmírnit procesy degenerace a zmírňuje bolest; má hřejivé účinky

source: Eye diseases leading to impaired vision;
cs_cz: Nemoci očí, které mohou vést až k slepotě;

source: Feel free to leave your contacts, if you want to get more information: the company offers comprehensive advice free of charge.
cs_cz: Neváhejte a sdělte nám své kontaktní informace, pokud chcete získat více informací: společnost nabízí komplexní poradenství zdarma.

source: Fir needle essential oil – has scientifically tested efficacy in relieving inflammation and stagnation processes in joints;
cs_cz: Olej z jedle balzámové - má vědecky testované účinky na léčbu zánětu a procesu ustrnutí v kloubech

source: GLYCOZAL CAN HELP YOU:
cs_cz: Glycozal vám může pomoci:

source: Galega officinalis extract – improves eye and skin protection on the cellular level;
cs_cz: Extrakt z jestřabiny lékařské - zvyšuje ochranu kůže a očí na buněčné úrovni;

source: Glycozal is formulated to include TEN natural ingredients working together to support healthy blood sugar levels
cs_cz: Glycozal zahrnuje DESET přírodních přísad, které pracují společně a zajišťují zdravou hladinu cukru v krvi

source: H.
cs_cz: K.

source: Heading: Hondrocream review: opinions, application, find in pharmacies
cs_cz: Heading: Recenze produktu Hondrocream: názory, aplikace, místa prodeje

source: Heading: SugaNorm caps review: opinions and experience, use, find in pharmacies
cs_cz: Heading: Recenze kapslí SugaNorm: názory a zkušenosti, použití, prodej

source: Helps Body Circulatory, Blood Vessel & Heart Health
cs_cz: Podporuje krevní oběh, posiluje cévy a srdce

source: Helps restore damages tissues;
cs_cz: Pomáhá obnovit poškozenou tkáň;

source: Hondrocream consists of:
cs_cz: Hlavní přísady krému Hondrocream:

source: Hondrocream for joints - information.
cs_cz: Krém na klouby Hondrocream - informace.

source: Hondrocream helps to improve the state of the patient, gives opportunity to move freely and pain-free, promote self-healing features and has no analogues at the market!
cs_cz: Hondrocream pomáhá zlepšit stav pacienta, dává mu možnost pohybovat se volně a bez bolesti, podporuje samoléčebné funkce a na trhu neexistuje žádná obdobná varianta.

source: Hondrocream is a perfect remedy to deal with inflammation, pain and discomfort with no health risks.
cs_cz: Hondrocream je dokonalý lék, který vám pomůže vypořádat se se záněty, bolestí a dalšími nepříjemnostmi bez jakýchkoli zdravotních rizik.

source: Hondrocream is completely natural and consists of organic lab-tested ingredients.
cs_cz: Hondrocream je naprosto přírodní a skládá se z organických složek testovaných v laboratoři.

source: Hondrocream is positioned on the market as a successful breakthrough, but many customers doubt, if it works indeed.
cs_cz: Hondrocream je novým průlomem na trhu, ale mnoho zákazníků pochybuje o jeho skvělých účincích.

source: Hondrocream – powerful painkilling and anti-inflammatory cream for joints and ligaments;
cs_cz: Hondrocream - silný protizánětlivý krém na klouby a vazy, který tiší bolest;

source: Horse chestnut oil – improves the blood circulation around the damaged tissues and promotes self-restoration activity;
cs_cz: Olej z kaštanovníku - zlepšuje krevní oběh v oblasti poškozené tkáně a podporuje proces léčení;

source: However, there are some negative feedback out there.
cs_cz: Bohužel se objevují i negativní recenze.

source: I appreciated professional advice from company consultants – they helped me with explanation of how to take it.
cs_cz: Oceňuji odborné poradenství od konzultantů společnosti - vysvětlili mi dávkování.

source: I recommend SugaNorm as a part of holistic diabetes treatment approach.
cs_cz: Doporučuji produkt SugaNorm jako součást celkové léčby cukrovky.

source: I recommend it to my patients!
cs_cz: Tento krém doporučuji všem svým pacientům.

source: I recommend this product for its natural components and their impressive action.
cs_cz: Tento produkt doporučuji pro jeho přírodní složení a působivé účinky.

source: If you have additional questions about the product – online consultants on the official website will be glad to answer.
cs_cz: Pokud máte jakékoli otázky ohledně našeho produktu, náš konzultant vám na ně rád odpoví na našich oficiálních webových stránkách.

source: If you have any additional questions about the product, you can leave your contacts and ask the company manager.
cs_cz: V případě jakýchkoli dalších dotazů o produktu nám můžete poskytnout váš kontakt a dotázat se přímo ředitele společnosti.

source: If you want to find out, how to take SugaNorm properly, refer to the information of the label or follow the instructions below:
cs_cz: Pro správnou indikaci produktu SugaNorm se řiďte informacemi na obalu a nebo instrukcemi níže.

source: If you want to have a clear idea on how to apply Hondrocream correctly, refer to the information on the package or read the instructions below:
cs_cz: Pro správné užití krému Hondrocream se řiďte informacemi na obalu a nebo instrukcemi níže.

source: Impaired stomach function;
cs_cz: Poruchu funkce žaludku;

source: Important: SugaNorm is not a medication, therefore you won’t find it in pharmacies and you shouldn’t completely replace the prescribed treatment with these caps.
cs_cz: Důležité: Výrobek SugaNorm není medikament, z tohoto důvodu jej nenaleznete v lékárnách a neměli byste jím nahradit předepsané léky.

source: Important: original Hondrocream can be found for sale only at the official website of legit sellers:
cs_cz: Důležité: originální krém Hondrocream lze nalézt pouze na oficiálních internetových stránkách prodejců:

source: In 3 days, I felt no pain and, in a week, managed to walk without too much efforts.
cs_cz: Za 3 dny jsem necítil žádnou bolest, po týdnu jsem mohl chodit bez přílišného úsilí.

source: In recent years a lot of new facts were revealed about type 1 and type 2 diabetes, its symptoms, complications and treatment.
cs_cz: V posledních letech byla odhalena další fakta o cukrovce typu 1. a 2. typu, symptomech, komplikacích a léčbě.

source: In this article our goal is to answer this question in detail.
cs_cz: Tento článek vám podrobně vysvětlí jak krém funguje a jaké jsou jeho přednosti.

source: In this article we present you detailed information we collected about these capsules, and the first thing you need to know is that SugaNorm works very well and sufficiently enhances the action of medications prescribed by your doctor.
cs_cz: V tomto článku se dozvíte detailní informace, které jsme shromáždili o těchto kapslích. První věc, kterou musíte vědět je, že kapsle SugaNorm opravdu fungují a dostatečně zvyšují účinky léků předepsaných vaším doktorem.

source: Inhibits manifestation of arthrosis and osteochondrosis;
cs_cz: Inhibuje projevy artrózy a osteochondrózy;

source: Instructions on how to take SugaNorm
cs_cz: Pokyny pro použití produktu SugaNorm

source: It can’t replace insulin injections, but the product helps to reduce the inconvenience caused by the diagnosis: risks, pains, constant thirst, excess weight etc.
cs_cz: Nemůže nahradit inzulínové injekce, ale pomáhá snižovat potíže způsobené touto diagnózou: bolesti, neustálou žízeň, nadváhu a další rizika

source: It happens so that counterfeiters analyze the market, pick effective and popular products and sell placebo under the brand name.
cs_cz: Podvodníci neustále analyzují trh, vybírají efektivní a populární produkty a prodávají placebo se stejným názvem produktu.

source: It has brilliant reputation on the market.
cs_cz: Na trhu má vynikající pověst.

source: It helps to conclude that the capsules work very well.
cs_cz: Díky tomu jsme došli k závěru, že kapsle fungují velmi dobře.

source: It helps to deal with several problems including aches and swelling.
cs_cz: Pomáhá řešit několik problémů. Tiší bolest a zmírňuje otoky.

source: It implies that you can’t buy original Hondrocream in pharmacies or on Amazon.
cs_cz: Z toho vyplývá, že Hondrocream nekoupíte na neoficiálních internetových stránkách ani v lékárnách.

source: It improved the condition in 94% of participants in 1 month!
cs_cz: Krém zlepšil stav 94 % pacientů a to již za jeden měsíc!

source: It is a perfect option to prevent diabetes in pre-diabetes state: capsules are safe and easily tolerated.
cs_cz: Jsou skvělou volbou pro prevenci cukrovky ve stadiu prediabetu: kapsle jsou bezpečné a dobře se vstřebávají.

source: It is completely free and available to all users, not only those, who place orders.
cs_cz: Poradenství zákazníkům je zcela zdarma a pro všechny uživatele, bez nutnosti objednávky zboží.

source: It is easily applied and can be combined with anti-inflammation and pain-killing medications for oral intake.
cs_cz: Snadno se aplikuje a může být použit v kombinaci s léky s protizánětlivými účinky a léky od bolesti.

source: It may cause life-threatening conditions.
cs_cz: Přerušení dávkování inzulínu by mohlo ohrozit váš život.

source: It means you won’t buy it in pharmacies, brick-and-mortar stores, on Amazon or other marketplaces.
cs_cz: Což znamená, že tento produkt nekoupíte v lékárnách, kamenných obchodech, na Amazonu nebo jiných prodejnách.

source: It means, you pay once and get a prolonged effect after.
cs_cz: To znamená, že zaplatíte jednou a užíváte si prodlouženého efektu dlouho po dobrání poslední kapsle.

source: It should be dry and clean.
cs_cz: Měla by být suchá a čistá.

source: It was delivered very fast, and I started using it.
cs_cz: Doručení bylo velmi rychlé a začal jsem ho brát okamžitě.

source: It’s up to you, whether to follow this recommendation or not, we just want our readers to be informed!
cs_cz: Je na vás, jestli se naší radou budete řídit, jen vás chceme varovat.

source: Jack Willson, therapist
cs_cz: Michal Drábek, terapeut

source: James Willson, 54
cs_cz: Martin Rybář, 54

source: Jameson – rehabilitation specialist
cs_cz: Čech - specialista na rehabilitaci

source: John Jackson, 47
cs_cz: Jan Kolář, 47

source: Jumping a bit ahead we can state it is effective and helps 94% of users, who apply it properly.
cs_cz: Z celkového hlediska je krém vysoce efektivní, při správné aplikaci pomohl 94 % uživatelům.

source: Keep Normal Your Blood Sugar Levels
cs_cz: Udržujte hladinu cukru v krvi na normální úrovni

source: Keira Phillips, thyroid specialist
cs_cz: Michaela Procházková, specialistka na štítnou žlázu

source: Lean how to place the order, how long does it take to get the cream, what are quality guarantees and so on.
cs_cz: Zjistěte, jak můžete provést objednávku, jak dlouho trvá dodání, jaké jsou garance kvality atd.

source: Leave the rest of the cream on the skin for 15 minutes for better action, do not wipe or wash away.
cs_cz: Zbytek krému do kůže nevmasírujte a počkejte 15 minut, zvýší se tím účinek krému. Krém nesmývejte ani nestírejte.

source: Let’s consider main reasons for that:
cs_cz: Podívejme se na hlavní důvody:

source: Link to the official website
cs_cz: Odkaz na oficiální stránky

source: Maintain normal blood sugar levels
cs_cz: Udržet normální hladinu cukru v krvi

source: Manufactures decided to avoid distribution through pharmacies and third-party online stores.
cs_cz: Výrobce se rozhodl distribuovat tento výrobek pouze skrze oficiální internetové stránky prodejců.

source: Manufactures refused using intermediaries to deliver the product to customers.
cs_cz: Výrobci odmítli prodej pomocí prostředníků, kteří by produkt zákazníkům dodávali.

source: Many creams in pharmacies cause addiction – i.e. you are not able to function without them anymore.
cs_cz: Mnoho krémů v lékárnách způsobuje závislost - tzn. nebudete bez nich moci normálně fungovat.

source: Many of this diseases and conditions are impossible to completely cure without expensive and sophisticated surgeries.
cs_cz: Mnoho z těchto nemocí a stavů je nemožné úplně vyléčit bez drahých a sofistikovaných operací.

source: Many people buy low-quality substitutes without even knowing it.
cs_cz: Mnoho lidí kupuje náhrašky nízké kvality, aniž by o tom věděli.

source: Menthol – 100% natural analgesic substance to eliminate pain and discomfort; powers up the combination of other ingredients;
cs_cz: Mentol - 100% přírodní analgetikum, které eliminuje bolest; posiluje funkci dalších přísad;

source: Milk thistle seeds – helps to control blood sugar level in normal range;
cs_cz: Semínka ostropestřce mariánského - pomáhají udržovat hladinu cukru v krvi v normální rozsahu;

source: Mint essential oil – for soothing painful areas, increase the abilities of the body to restore the cells.
cs_cz: Olej z máty peprné - uklidňuje bolest v postižených oblastech, pomáhá tělu obnovit buňky.

source: More information about proper application, general advice, contraindications, side effects and manufacturer of Hondrocream you can find below.
cs_cz: Detailní informace a obecné rady, správné užití, kontraindikace, vedlejší účinky a informace o výrobci krému Hondrocream naleznete níže.

source: More than 70% of customers made one more purchase for themselves, their friends or family.
cs_cz: Více než 70 % zákazníků nakoupilo více než jednou a to buď pro sebe, nebo pro kamarády a rodinu.

source: Most customers appreciate this approach: they just leave their contact information, wait for the manager call, place the order and receive the package directly.
cs_cz: Valná většina zákazníků tento přístup oceňuje: pouze zanechají svůj kontakt, počkají na hovor od manažera, objednají si požadovaný počet výrobků a jednoduše obdrží balíček.

source: Most of customers, who were disappointed with the product quality bought a counterfeited product online.
cs_cz: Většina zákazníků, kteří byli zklamáni kvalitou produktů, zakoupila na internetu padělek.

source: Most of our center clients can get back to fitness in a month.
cs_cz: Mnoho klientů našeho centra se mohou během pouhého měsíce vrátit zpět do posilovny.

source: My wife found a website of Hondrocream, where we ordered it.
cs_cz: To má žena našla a objednala krém z webových stránek Hondrocream.

source: Never exceed the recommended dosage.
cs_cz: Nikdy nepřekračujte doporučené dávkování.

source: Never neglect medical advice.
cs_cz: Nikdy nezanedbávejte rady lékaře.

source: No more terrible headaches and edema.
cs_cz: Přestala mě bolet hlava a zmizely všechny otoky.

source: No remedies helped for a long time, I had to take pills and visit physiotherapists 3 times a week.
cs_cz: Žádné léčivé prostředky nepomáhaly, bral jsem spousty prášků a třikrát týdně navštěvoval fyzioterapeuta.

source: ORDER NOW
cs_cz: OBJEDNAT NYNÍ

source: One package is enough for the entire course.
cs_cz: Jedno balení vystačí na celý průběh léčby.

source: Original website of SugaNorm can be copied by swindlers to create an illusion of safe purchase.
cs_cz: Originální internetové stránky produktu SugaNorm mohou být okopírovány podvodníky, kteří chtějí okrást zákazníky.

source: Over 35 thousand of customers apply Hondrocream and see remarkable results.
cs_cz: Více než 35 tisíc uživatelů používá Hondrocream a pociťují pozoruhodné výsledky.

source: Over 50 thousand packages of SugaNorm caps have been sold worldwide last year.
cs_cz: Jen minulý rok bylo na celém světě prodáno přes 50 tisíc kapslí SugaNorm.

source: Pancreatic islets stimulation;
cs_cz: Stimulaci Langerhansových ostrůvků;
